{
  "zenPlugin_bankMessageError": "Synchronization error.\n\nMessage from the bank: %1$s",
  "zenPlugin_fetchError": "The list of banks is temporarily unavailable. Try later.",
  "zenPlugin_fetchingDataError": "This bank connection is temporarily unavailable. Please, try later.",
  "zenPlugin_finished": "Sync finished. No new transactions.",
  "zenPlugin_finishedWithCount": "New transactions synced: %1$d",
  "zenPlugin_incompatibleVersionError": "You have an old version of the Zenmoney app. Update it to the latest version to make it work properly.",
  "zenPlugin_invalidLoginOrPasswordError": "Incorrect bank login or password",
  "zenPlugin_invalidOtpCodeError": "The code is incorrect. Try again — tap \"Connect\" and enter a new code.",
  "zenPlugin_invalidPreferencesError": "Please check the entered data.",
  "zenPlugin_keychainError": "Unable to sync with the bank. Restart your phone and try again.",
  "zenPlugin_keychainErrorIos": "Unable to sync with the bank. Restart your phone and try again.",
  "zenPlugin_networkError": "No network access or bank server is unavailable. Try to start the sync later.",
  "zenPlugin_noAccountsError": "The bank is not connected because no account was selected. Repeat the connection process and select at least one bank account.",
  "zenPlugin_nordigenNoAccountsToSyncError": "All synchronized accounts of this bank are closed or temporarily inactive. Link the bank again and select new accounts to sync.",
  "zenPlugin_nordigenRequestLimitExceededError": "The bank limits the number of updates per day. Next time you can get an update tomorrow.",
  "zenPlugin_notImplementedError": "This connection is not active yet, but we are working on it. It will help us a lot if you send a log.",
  "zenPlugin_obligatoryFieldsNotFilled": "Please fill in all required fields.",
  "zenPlugin_passwordExpiredError": "The password has expired. Change it in the bank app, and then update it in the connection settings.",
  "zenPlugin_pinCodeInsteadOfPasswordError": "It looks like you entered a PIN instead of a password. The password and the PIN code from the bank app are different passwords. If you do not remember your password, restore it on the bank's website.",
  "zenPlugin_pluginError": "An error occurred while syncing with bank. Send the log so that we can find and fix the error.",
  "zenPlugin_previousSessionNotClosedError": "The bank doesn't allow sync with Zenmoney if the bank app is open. Close the bank app, wait 10 minutes and start the sync in Zenmoney again.",
  "zenPlugin_reportError": "Send log",
  "zenPlugin_severalAccountsLinkingError": "Several bank accounts are linked with one account in Zenmoney. For correct synchronization, each bank account must be associated with a separate account in Zenmoney. Open the account settings imported from this bank and delete the account numbers. Then run the sync and link accounts from the bank with accounts in Zenmoney.",
  "zenPlugin_temporaryUnavailableError": "Temporarily unable to receive data from the bank. Try syncing again after a while.\n\nIf you still get the error, go to Accounts, tap the bank card and then — \"Send log to developers\"."
}
