{
  "zenPlugin_bankMessageError": "Во время синхронизации произошла ошибка.\n\nСообщение от банка: %1$s",
  "zenPlugin_fetchError": "Список банков временно недоступен. Попробуйте позже.",
  "zenPlugin_fetchingDataError": "Это подключение временно недоступно. Попробуйте позже.",
  "zenPlugin_finished": "Синхронизация с банком завершена. Новых операций нет.",
  "zenPlugin_finishedWithCount": "Синхронизация с банком завершена. Новых операций: %1$d",
  "zenPlugin_incompatibleVersionError": "У вас старая версия приложения Дзен-мани. Обновите приложение до последней версии, чтобы всё работало корректно.",
  "zenPlugin_invalidLoginOrPasswordError": "Неверный логин или пароль от банка",
  "zenPlugin_invalidOtpCodeError": "Код неверный. Попробуйте снова — нажмите \"Подключить\" и введите новый код.",
  "zenPlugin_invalidPreferencesError": "Пожалуйста, проверьте введённые данные.",
  "zenPlugin_keychainError": "Не удается синхронизироваться с банком. Перезагрузите телефон и попробуйте ещё раз.",
  "zenPlugin_keychainErrorIos": "Не удается синхронизироваться с банком. Перезагрузите телефон и попробуйте ещё раз.",
  "zenPlugin_networkError": "Нет доступа к сети или сервер банка недоступен. Попробуйте запустить синхронизацию позже.",
  "zenPlugin_noAccountsError": "Банк не удалось подключить, потому что ни один счёт не выбран. Повторите процесс подключения и выберите хотя бы один счёт.",
  "zenPlugin_nordigenNoAccountsToSyncError": "Все синхронизированные счета из этого банка закрыты или временно не активны. Подключите банк еще раз и выберите новые счета для синхронизации.",
  "zenPlugin_nordigenRequestLimitExceededError": "Банк ограничивает количество обновлений в день. В следующий раз вы можете получить обновление завтра.",
  "zenPlugin_notImplementedError": "Это подключение пока не активно, но мы работаем над этим. Нам очень поможет, если вы пришлёте лог.",
  "zenPlugin_obligatoryFieldsNotFilled": "Пожалуйста, заполните все обязательные поля.",
  "zenPlugin_passwordExpiredError": "Пароль от банка устарел. Поменяйте его в приложении или на сайте банка, а потом обновите в настройках подключения в Дзен-мани.",
  "zenPlugin_pinCodeInsteadOfPasswordError": "Похоже, вы ввели пин-код вместо пароля. Пароль и пин-код от приложения — это разные пароли. Если вы не помните пароль, восстановите его на сайте банка.",
  "zenPlugin_pluginError": "Ошибка в данных из банка. Отправьте лог, чтобы мы смогли найти и исправить ошибку.",
  "zenPlugin_previousSessionNotClosedError": "Банк не даёт запустить синхронизацию в Дзен-мани, если открыто приложение банка. Закройте приложение, подождите 10 минут и запустите синхронизацию в Дзен-мани ещё раз.",
  "zenPlugin_reportError": "Отправить лог",
  "zenPlugin_severalAccountsLinkingError": "Несколько счетов из банка ассоциированы с одним счётом в Дзен-мани. Для корректной синхронизации каждый счёт из банка должен быть ассоциирован с отдельным счётом в Дзен-мани. Откройте настройки счетов, импортированных из этого банка, и удалите номера счетов. Затем запустите синхронизацию и заново сопоставьте счета из банка со счетами в Дзен-мани.",
  "zenPlugin_temporaryUnavailableError": "Банк временно не отвечает на запросы. Повторите синхронизацию через некоторое время.\n\nЕсли ошибка возникнет снова, зайдите в Счета, тапните на карточку банка и нажмите \"Отправить лог разработчикам\"."
}
