{
  "zenPlugin_bankMessageError": "Під час синхронізації виникла помилка.\\n\\nПовідомлення від банку: %1$s",
  "zenPlugin_fetchError": "Список банків тимчасово недоступний. Спробуйте пізніше.",
  "zenPlugin_fetchingDataError": "Це підключення тимчасово недоступне. Спробуй пізніше.",
  "zenPlugin_finished": "Дані синхронізовані. Нових операцій немає.",
  "zenPlugin_finishedWithCount": "Синхронізовано нових операцій: %1$d",
  "zenPlugin_incompatibleVersionError": "У вас стара версія програми Дзен-мані. Щоб усе працювало коректно, оновіть програму до останньої версії.",
  "zenPlugin_invalidLoginOrPasswordError": "Невірний логін або пароль від банку",
  "zenPlugin_invalidOtpCodeError": "Код неправильний. Спробуйте знову — натисніть \"Підключити\" і введіть новий код.",
  "zenPlugin_invalidPreferencesError": "Будь ласка, перевірте введені дані.",
  "zenPlugin_keychainError": "Не вдається синхронізуватись із банком. Перезавантажте телефон і спробуйте ще раз.",
  "zenPlugin_keychainErrorIos": "Не вдалося синхронізувати з банком. Перезавантажте телефон і повторіть спробу.",
  "zenPlugin_networkError": "Немає доступу до мережі або сервер банку недоступний. Спробуйте запустити синхронізацію пізніше.",
  "zenPlugin_noAccountsError": "Банк не вдалося підключити, тому що жодного рахунку не обрано. Повторіть процес підключення та виберіть хоча б один рахунок.",
  "zenPlugin_nordigenNoAccountsToSyncError": "Усі синхронізовані рахунки цього банку закриті чи тимчасово не активні. Підключіть банк ще раз та виберіть нові рахунки для синхронізації.",
  "zenPlugin_nordigenRequestLimitExceededError": "Банк обмежує кількість оновлень на день. Наступного разу ви можете отримати оновлення завтра.",
  "zenPlugin_notImplementedError": "Це підключення поки що не активне, але ми працюємо над цим. Нам дуже допоможе, якщо ви надішлете лог.",
  "zenPlugin_obligatoryFieldsNotFilled": "Будь ласка, заповніть усі обов'язкові поля.",
  "zenPlugin_passwordExpiredError": "Пароль застарів. Змініть його у банківському додатку та оновіть його в установках підключення.",
  "zenPlugin_pinCodeInsteadOfPasswordError": "Схоже, ви запровадили пін код замість пароля. Пароль та пін-код від програми – це різні паролі. Якщо не пам'ятаєте пароль, відновити його на сайті банку.",
  "zenPlugin_pluginError": "Помилка даних з банку. Надішліть лог, щоб ми змогли знайти і виправити помилку.",
  "zenPlugin_previousSessionNotClosedError": "Банк не дає запустити синхронізацію в Дзен-мані, якщо відкрито програму банку. Закрийте програму, зачекайте 10 хвилин і знову запустіть синхронізацію в Дзен-мані.",
  "zenPlugin_reportError": "Надіслати лог",
  "zenPlugin_severalAccountsLinkingError": "Несколько рахунків з банку асоційовані з одним рахунком в Дзен-мані. Для правильної роботи синхронізації потрібно кожен рахунок з банку асоціювати з окремим рахунком в Дзен-мані. Відкрийте налаштування рахунків, імпортується з цього банку, та видаліть рахунки. Запустите синхронізацію та знову поповніть рахунки з банку з рахунками в Дзен-мані.",
  "zenPlugin_temporaryUnavailableError": "Банк тимчасово не відповідає на запити. Повторіть синхронізацію через деякий час.\\n\\nЯкщо виникне помилка, зайдіть у Рахунки, клацніть картку банку та натисніть \"Надіслати лог\"."
}
