/* eslint-disable no-irregular-whitespace */
import { parseTransactions } from '../../api'

describe('parseTransactions', () => {
  it.each([
    [
      `Дата
проведения
операции
Дата
обработки
операции
Описание операции
Сумма
операции
Валюта
операции
Приход в
валюте счета
Расход в
валюте счета
Комиссия No карточки/счета
Выписка по счету: KZ396010012001119324 8
16.07.2024 16.07.2024 Операция оплаты у
коммерсанта DIONA SHOP
- 5 129,00 KZT 0,00 - 5 129,00 0,00 440563******4384
18.07.2024 18.07.2024 Операция оплаты у
коммерсанта
GASTRONOM
SUPERMARKET
- 8 138,00 KZT 0,00 - 8 138,00 0,00 440563******4384
18.07.2024 18.07.2024 Операция оплаты у
коммерсанта GALMART
SUPERMARKET KASS
- 1 355,00 KZT 0,00 - 1 355,00 0,00 440563******4384
21.07.2024 21.07.2024 Операция оплаты у
коммерсанта SMALL
SUPERMARKET AST33
- 380,00 KZT 0,00 - 380,00 0,00 440563******4384
21.07.2024 21.07.2024 Операция оплаты у
коммерсанта MARWIN
BOUTIQUE
- 11 990,00 KZT 0,00 - 11 990,00 0,00 440563******4384
21.07.2024 21.07.2024 Операция оплаты у
коммерсанта MARWIN
BOUTIQUE
- 30,00 KZT 0,00 - 30,00 0,00 440563******4384
21.07.2024 21.07.2024 Операция оплаты у
коммерсанта VKUS MART
SUPERMARKET CA
- 5 610,00 KZT 0,00 - 5 610,00 0,00 440563******4384
23.07.2024 24.07.2024 Операция оплаты у
коммерсанта
FFPAY*OLX.KZ
- 2 645,00 KZT 0,00 - 2 645,00 0,00 440563******4384
24.07.2024 24.07.2024 Операция оплаты у
коммерсанта GALMART
SUPERMARKET KASS
- 4 575,00 KZT 0,00 - 4 575,00 0,00 440563******4384
25.07.2024 25.07.2024 Операция оплаты у
коммерсанта GLOBAL
COFFEE KOFEINYA
- 1 940,00 KZT 0,00 - 1 940,00 0,00 440563******4384
27.07.2024 28.07.2024 Операция оплаты у
коммерсанта OZON.KZ
- 7 922,00 KZT 0,00 - 7 922,00 0,00 440563******4384
06.08.2024 06.08.2024 Операция оплаты у
коммерсанта
WILDBERRIES
- 11 270,00 KZT 0,00 - 11 270,00 0,00 440563******4384
08.08.2024 08.08.2024 Зачисление с депозита 40 000,00 KZT 40 000,00 0,00 0,00 KZ396010012001119324
08.08.2024 13.08.2024 Операция оплаты у
коммерсанта OZON
- 12 837,00 KZT 0,00 - 12 837,00 0,00 440563******4384
09.08.2024 11.08.2024 Операция оплаты у
коммерсанта OZON.KZ
- 6 719,00 KZT 0,00 - 6 719,00 0,00 440563******4384
10.08.2024 10.08.2024 Ежемесячная комиссия за
обслуживание карточки
Regular Charge
0,00 0,00 0,00 - 150,00 440563******4384
11.08.2024 13.08.2024 Операция оплаты у
коммерсанта OZON.KZ
- 6 580,00 KZT 0,00 - 6 580,00 0,00 440563******4384
11.08.2024 11.08.2024 Поступление перевода 500 000,00 KZT 500 000,00 0,00 0,00 KZ396010012001119324
14.08.2024 15.08.2024 Поступление перевода 304 426,00 KZT 304 426,00 0,00 0,00 440563******4384
14.08.2024 14.08.2024 Перевод на другую карту - 150 000,00 KZT 0,00 - 150 150,00 0,00 440563******4384
14.08.2024 14.08.2024 Перевод на депозит - 500 000,00 KZT 0,00 - 500 000,00 0,00 KZ396010012001119324
14.08.2024 14.08.2024 Перевод на другую карту - 130 000,00 KZT 0,00 - 130 150,00 0,00 440563******4384
15.08.2024 15.08.2024 Операция оплаты у
коммерсанта FOOD
SOLUTIONS KZ RESTAUR
- 7 850,00 KZT 0,00 - 7 850,00 0,00 440563******4384
19.08.2024 19.08.2024 Зачисление с депозита 100 000,00 KZT 100 000,00 0,00 0,00 KZ396010012001119324
19.08.2024 19.08.2024 Перевод на другую карту - 100 000,00 KZT 0,00 - 100 150,00 0,00 440563******4384
22.08.2024 23.08.2024 Операция оплаты у
коммерсанта OZON.KZ
- 8 447,00 KZT 0,00 - 8 447,00 0,00 440563******4384
23.08.2024 24.08.2024 Операция оплаты у
коммерсанта OZON.KZ
- 3 075,00 KZT 0,00 - 3 075,00 0,00 440563******4384
02.09.2024 02.09.2024 Перевод на другую карту - 16 500,00 KZT 0,00 - 16 650,00 0,00 440563******4384
02.09.2024 02.09.2024 Зачисление с депозита 20 000,00 KZT 20 000,00 0,00 0,00 KZ396010012001119324
02.09.2024 02.09.2024 Операция оплаты у
коммерсанта WHOOPIE
CAKES CAFE
- 1 690,00 KZT 0,00 - 1 690,00 0,00 KZ396010012001119324
04.09.2024 04.09.2024 Зачисление с депозита 60 000,00 KZT 60 000,00 0,00 0,00 KZ396010012001119324
04.09.2024 04.09.2024 Перевод на другую карту - 60 000,00 KZT 0,00 - 60 000,00 0,00 KZ396010012001119324

Дата
проведения
операции
Дата
обработки
операции
Описание операции
Сумма
операции
Валюта
операции
Приход в
валюте счета
Расход в
валюте счета
Комиссия No карточки/счета
Выписка по счету: KZ396010012001119324 9
10.09.2024 10.09.2024 Ежемесячная комиссия за
обслуживание карточки
Regular Charge
0,00 0,00 0,00 - 150,00 440563******4384
10.09.2024 10.09.2024 Поступление перевода 500 000,00 KZT 500 000,00 0,00 0,00 KZ396010012001119324
10.09.2024 10.09.2024 Перевод на другую карту - 90 000,00 KZT 0,00 - 90 150,00 0,00 440563******4384
10.09.2024 10.09.2024 Перевод на депозит - 400 000,00 KZT 0,00 - 400 000,00 0,00 KZ396010012001119324
10.09.2024 10.09.2024 Операция оплаты у
коммерсанта NASH
MAGAZIN SHOP
- 2 070,00 KZT 0,00 - 2 070,00 0,00 KZ396010012001119324
10.09.2024 10.09.2024 Операция оплаты у
коммерсанта NASH
MAGAZIN SHOP
- 220,00 KZT 0,00 - 220,00 0,00 KZ396010012001119324
11.09.2024 12.09.2024 Операция оплаты у
коммерсанта TOO "TA
FARM"
- 8 200,00 KZT 0,00 - 8 200,00 0,00 440563******4384
11.09.2024 11.09.2024 Зачисление с депозита 25 000,00 KZT 25 000,00 0,00 0,00 KZ396010012001119324
11.09.2024 11.09.2024 Операция оплаты у
коммерсанта
MAGNUM.AF21.KASSA- 2
- 25 591,00 KZT 0,00 - 25 591,00 0,00 KZ396010012001119324
12.09.2024 12.09.2024 Операция оплаты у
коммерсанта 250- DRUG
STORE
- 1 790,00 KZT 0,00 - 1 790,00 0,00 KZ396010012001119324
14.09.2024 15.09.2024 Поступление перевода 301 270,00 KZT 301 270,00 0,00 0,00 440563******4384
14.09.2024 14.09.2024 Перевод на другую карту - 290 000,00 KZT 0,00 - 290 150,00 0,00 440563******4384
15.09.2024 15.09.2024 Зачисление с депозита 26 000,00 KZT 26 000,00 0,00 0,00 KZ396010012001119324
15.09.2024 15.09.2024 Перевод на другую карту - 26 550,00 KZT 0,00 - 26 700,00 0,00 440563******4384
17.09.2024 17.09.2024 Поступление перевода 40 000,00 KZT 40 000,00 0,00 0,00 KZ396010012001119324
17.09.2024 17.09.2024 Перевод на депозит - 40 000,00 KZT 0,00 - 40 000,00 0,00 KZ396010012001119324
Место печати Банка
Выписка действительна при наличии печати Банка`,
      [
        {
          amount: '-5 129,00',
          currency: 'KZT',
          date: '16.07.2024',
          description: 'Операция оплаты у коммерсанта DIONA SHOP',
          expense: '-5 129,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-8 138,00',
          currency: 'KZT',
          date: '18.07.2024',
          description: 'Операция оплаты у коммерсанта GASTRONOM SUPERMARKET',
          expense: '-8 138,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-1 355,00',
          currency: 'KZT',
          date: '18.07.2024',
          description: 'Операция оплаты у коммерсанта GALMART SUPERMARKET KASS',
          expense: '-1 355,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-380,00',
          currency: 'KZT',
          date: '21.07.2024',
          description: 'Операция оплаты у коммерсанта SMALL SUPERMARKET AST33',
          expense: '-380,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-11 990,00',
          currency: 'KZT',
          date: '21.07.2024',
          description: 'Операция оплаты у коммерсанта MARWIN BOUTIQUE',
          expense: '-11 990,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-30,00',
          currency: 'KZT',
          date: '21.07.2024',
          description: 'Операция оплаты у коммерсанта MARWIN BOUTIQUE',
          expense: '-30,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-5 610,00',
          currency: 'KZT',
          date: '21.07.2024',
          description: 'Операция оплаты у коммерсанта VKUS MART SUPERMARKET CA',
          expense: '-5 610,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-2 645,00',
          currency: 'KZT',
          date: '23.07.2024',
          description: 'Операция оплаты у коммерсанта FFPAY*OLX.KZ',
          expense: '-2 645,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-4 575,00',
          currency: 'KZT',
          date: '24.07.2024',
          description: 'Операция оплаты у коммерсанта GALMART SUPERMARKET KASS',
          expense: '-4 575,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-1 940,00',
          currency: 'KZT',
          date: '25.07.2024',
          description: 'Операция оплаты у коммерсанта GLOBAL COFFEE KOFEINYA',
          expense: '-1 940,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-7 922,00',
          currency: 'KZT',
          date: '27.07.2024',
          description: 'Операция оплаты у коммерсанта OZON.KZ',
          expense: '-7 922,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-11 270,00',
          currency: 'KZT',
          date: '06.08.2024',
          description: 'Операция оплаты у коммерсанта WILDBERRIES',
          expense: '-11 270,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '40 000,00',
          currency: 'KZT',
          date: '08.08.2024',
          description: 'Зачисление с депозита',
          expense: '0,00',
          fee: '0,00',
          income: '40 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-12 837,00',
          currency: 'KZT',
          date: '08.08.2024',
          description: 'Операция оплаты у коммерсанта OZON',
          expense: '-12 837,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-6 719,00',
          currency: 'KZT',
          date: '09.08.2024',
          description: 'Операция оплаты у коммерсанта OZON.KZ',
          expense: '-6 719,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '0,00',
          currency: '',
          date: '10.08.2024',
          description: 'Ежемесячная комиссия за обслуживание карточки Regular Charge',
          expense: '0,00',
          fee: '-150,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-6 580,00',
          currency: 'KZT',
          date: '11.08.2024',
          description: 'Операция оплаты у коммерсанта OZON.KZ',
          expense: '-6 580,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '500 000,00',
          currency: 'KZT',
          date: '11.08.2024',
          description: 'Поступление перевода',
          expense: '0,00',
          fee: '0,00',
          income: '500 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '304 426,00',
          currency: 'KZT',
          date: '14.08.2024',
          description: 'Поступление перевода',
          expense: '0,00',
          fee: '0,00',
          income: '304 426,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-150 000,00',
          currency: 'KZT',
          date: '14.08.2024',
          description: 'Перевод на другую карту',
          expense: '-150 150,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-500 000,00',
          currency: 'KZT',
          date: '14.08.2024',
          description: 'Перевод на депозит',
          expense: '-500 000,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-130 000,00',
          currency: 'KZT',
          date: '14.08.2024',
          description: 'Перевод на другую карту',
          expense: '-130 150,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-7 850,00',
          currency: 'KZT',
          date: '15.08.2024',
          description: 'Операция оплаты у коммерсанта FOOD SOLUTIONS KZ RESTAUR',
          expense: '-7 850,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '100 000,00',
          currency: 'KZT',
          date: '19.08.2024',
          description: 'Зачисление с депозита',
          expense: '0,00',
          fee: '0,00',
          income: '100 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-100 000,00',
          currency: 'KZT',
          date: '19.08.2024',
          description: 'Перевод на другую карту',
          expense: '-100 150,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-8 447,00',
          currency: 'KZT',
          date: '22.08.2024',
          description: 'Операция оплаты у коммерсанта OZON.KZ',
          expense: '-8 447,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-3 075,00',
          currency: 'KZT',
          date: '23.08.2024',
          description: 'Операция оплаты у коммерсанта OZON.KZ',
          expense: '-3 075,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-16 500,00',
          currency: 'KZT',
          date: '02.09.2024',
          description: 'Перевод на другую карту',
          expense: '-16 650,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '20 000,00',
          currency: 'KZT',
          date: '02.09.2024',
          description: 'Зачисление с депозита',
          expense: '0,00',
          fee: '0,00',
          income: '20 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-1 690,00',
          currency: 'KZT',
          date: '02.09.2024',
          description: 'Операция оплаты у коммерсанта WHOOPIE CAKES CAFE',
          expense: '-1 690,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '60 000,00',
          currency: 'KZT',
          date: '04.09.2024',
          description: 'Зачисление с депозита',
          expense: '0,00',
          fee: '0,00',
          income: '60 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-60 000,00',
          currency: 'KZT',
          date: '04.09.2024',
          description: 'Перевод на другую карту',
          expense: '-60 000,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '0,00',
          currency: '',
          date: '10.09.2024',
          description: 'Ежемесячная комиссия за обслуживание карточки Regular Charge',
          expense: '0,00',
          fee: '-150,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '500 000,00',
          currency: 'KZT',
          date: '10.09.2024',
          description: 'Поступление перевода',
          expense: '0,00',
          fee: '0,00',
          income: '500 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-90 000,00',
          currency: 'KZT',
          date: '10.09.2024',
          description: 'Перевод на другую карту',
          expense: '-90 150,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-400 000,00',
          currency: 'KZT',
          date: '10.09.2024',
          description: 'Перевод на депозит',
          expense: '-400 000,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-2 070,00',
          currency: 'KZT',
          date: '10.09.2024',
          description: 'Операция оплаты у коммерсанта NASH MAGAZIN SHOP',
          expense: '-2 070,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-220,00',
          currency: 'KZT',
          date: '10.09.2024',
          description: 'Операция оплаты у коммерсанта NASH MAGAZIN SHOP',
          expense: '-220,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-8 200,00',
          currency: 'KZT',
          date: '11.09.2024',
          description: 'Операция оплаты у коммерсанта TOO "TA FARM"',
          expense: '-8 200,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '25 000,00',
          currency: 'KZT',
          date: '11.09.2024',
          description: 'Зачисление с депозита',
          expense: '0,00',
          fee: '0,00',
          income: '25 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-25 591,00',
          currency: 'KZT',
          date: '11.09.2024',
          description: 'Операция оплаты у коммерсанта MAGNUM.AF21.KASSA- 2',
          expense: '-25 591,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-1 790,00',
          currency: 'KZT',
          date: '12.09.2024',
          description: 'Операция оплаты у коммерсанта 250- DRUG STORE',
          expense: '-1 790,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '301 270,00',
          currency: 'KZT',
          date: '14.09.2024',
          description: 'Поступление перевода',
          expense: '0,00',
          fee: '0,00',
          income: '301 270,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '-290 000,00',
          currency: 'KZT',
          date: '14.09.2024',
          description: 'Перевод на другую карту',
          expense: '-290 150,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '26 000,00',
          currency: 'KZT',
          date: '15.09.2024',
          description: 'Зачисление с депозита',
          expense: '0,00',
          fee: '0,00',
          income: '26 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-26 550,00',
          currency: 'KZT',
          date: '15.09.2024',
          description: 'Перевод на другую карту',
          expense: '-26 700,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: '440563******4384'
        },
        {
          amount: '40 000,00',
          currency: 'KZT',
          date: '17.09.2024',
          description: 'Поступление перевода',
          expense: '0,00',
          fee: '0,00',
          income: '40 000,00',
          accountNumber: 'KZ396010012001119324'
        },
        {
          amount: '-40 000,00',
          currency: 'KZT',
          date: '17.09.2024',
          description: 'Перевод на депозит',
          expense: '-40 000,00',
          fee: '0,00',
          income: '0,00',
          accountNumber: 'KZ396010012001119324'
        }
      ]
    ]
  ])('parses transactions', (text, transactions) => {
    expect(parseTransactions(text)).toEqual(transactions)
  })
})
